# Before you start :
   - These exercises are related to the Pivot table and correlation lessons.
   - Keep in mind that you need to use some of the functions you learned in the previous lessons.
   - All datasets are provided in the `your-code` folder of this lab.
   - Elaborate your codes and outputs as much as you can.
   - Try your best to answer the questions and complete the tasks and most importantly enjoy the process!!!

#### Import all the libraries that are necessary

In [11]:
import warnings
warnings.simplefilter('ignore')

import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

import pandas as pd
pd.set_option('display.max_columns', None)

import numpy as np

# Challenge 1

#### Open the ` Employee.csv` file and name your dataset `employee`

In [10]:
employee=pd.read_csv('Employee.csv')

employee.columns=[e.lower().replace(' ', '_') for e in employee.columns]

employee.head(10)

     name department education gender      title  years  salary
0    Jose         IT  Bachelor      M    analyst      1      35
1   Maria         IT    Master      F    analyst      2      30
2   David         HR    Master      M    analyst      2      30
3   Sonia         HR  Bachelor      F    analyst      4      35
4  Samuel      Sales    Master      M  associate      3      55
5     Eva      Sales  Bachelor      F  associate      2      55
6  Carlos         IT    Master      M         VP      8      70
7   Pedro         IT       Phd      M  associate      7      60
8     Ana         HR    Master      F         VP      8      70

#### What's the mean salary by department. 
##### Tip : There are 2 ways to do it - one way is with and the other way is without pivot tables. Do it both ways.

In [13]:
sueldo = pd.pivot_table(employee, values='salary', index=['department'], aggfunc=np.mean)
sueldo

            salary
department
HR           45.00
IT           48.75
Sales        55.00

In [14]:
sueldi = employee.groupby(['department'])['salary'].mean()
sueldi

department
HR       45.00
IT       48.75
Sales    55.00
Name: salary, dtype: float64

#### We want now to group the data by more than one column. Use Pandas pivot table function to select the mean salary by department and title

In [16]:
sueldo2 = pd.pivot_table(employee, values='salary', index=['department', 'title'], aggfunc=np.mean)
sueldo2

                      salary
department title
HR         VP           70.0
           analyst      32.5
IT         VP           70.0
           analyst      32.5
           associate    60.0
Sales      associate    55.0

#### We want to display the number of years of work experience and the salary for each Title. Add Years as a column in your pivot table
*Hint: Use Pandas doc(see References in README.md) to explore the pivot_table() arguments*

In [19]:
sueldo3 = pd.pivot_table(employee, values='salary', index=['title'], columns=['years'])
sueldo3

years         1     2     3     4     7     8
title
VP          NaN   NaN   NaN   NaN   NaN  70.0
analyst    35.0  30.0   NaN  35.0   NaN   NaN
associate   NaN  55.0  55.0   NaN  60.0   NaN

#### We want to know the information about the mean salary and number of employees in each department and for each job title

In [25]:
sueldo4 = pd.pivot_table(employee, values='salary', index=['department', 'title'], 
                         aggfunc={'salary': 'mean', 'title': 'count'})
sueldo4

                      salary  title
department title
HR         VP           70.0      1
           analyst      32.5      2
IT         VP           70.0      1
           analyst      32.5      2
           associate    60.0      1
Sales      associate    55.0      2

#### We want to know for each department and for each job title the Salary's median,minimum,maximum and standard deviation. Comment your results

In [29]:
sueldo5 = pd.pivot_table(employee, values='salary', index=['department', 'title'], 
                         aggfunc={'salary': [np.median, np.min, np.max, np.std]})
sueldo5

#Used the power of the aggfunc parameter

                      amax  amin  median       std
department title
HR         VP           70    70    70.0       NaN
           analyst      35    30    32.5  3.535534
IT         VP           70    70    70.0       NaN
           analyst      35    30    32.5  3.535534
           associate    60    60    60.0       NaN
Sales      associate    55    55    55.0  0.000000

#### Based on your comments, fill the missing values with an appropriate value

In [30]:
sueldo6 = pd.pivot_table(employee, 
                         values='salary', index=['department', 'title'], 
                         aggfunc={'salary': [np.median, np.min, np.max, np.std]}, 
                         fill_value=0)
sueldo6

#No std because values are unique, 
#either because both earn the same or because there is only one employee

                      amax  amin  median       std
department title
HR         VP           70    70    70.0  0.000000
           analyst      35    30    32.5  3.535534
IT         VP           70    70    70.0  0.000000
           analyst      35    30    32.5  3.535534
           associate    60    60    60.0  0.000000
Sales      associate    55    55    55.0  0.000000

#### The stake holders want to know for each department the number of employees and how much money is spend on salaries. Could you provide that information?

In [40]:
sueldo7 = pd.pivot_table(employee, 
                         values=['salary', 'name'], index=['department'], 
                         aggfunc={'salary': 'sum', 'name': 'count'}, 
                         fill_value=0)
sueldo7

            name  salary
department
HR             3     135
IT             4     195
Sales          2     110

#### For each Department and Title, we want to know the the total years of work experience and the mean salary

In [41]:
sueldo8 = pd.pivot_table(employee, 
                         values=['salary', 'years'], index=['department', 'title'], 
                         aggfunc={'salary': 'mean', 'years': 'sum'}, 
                         fill_value=0)
sueldo8

                      salary  years
department title
HR         VP           70.0      8
           analyst      32.5      6
IT         VP           70.0      8
           analyst      32.5      3
           associate    60.0      7
Sales      associate    55.0      5

#### Bonus

#### We now want to compute the mean salary after removing the maxima for each Department. Create the appropriate pivot table

#### * Hint: Write a custom function*

In [ ]:
# your answer here

In [ ]:
# your answer here

# Challenge 2

#### Open the ` Fitbit.csv` file and name your dataset `fitbit`

In [ ]:
# your answer here

#### Explore you dataset in terms of data types and descriptive statistics
#### *Hint: Use Pandas functions from previous lectures*

In [ ]:
# your answer here

In [ ]:
# your answer here

#### You suspect that there must be a linear relationship between the Minutes Very Active and the Steps. Compute the correlation between these variables.

In [ ]:
# your answer here

#### Use matplotlib to visually plot Minutes Very active vs Steps. 

##### Hint : import matplotlib.pyplot as plt (See previous lessons)#####
- Use plt.scatter(x=df['col_name_1'], y=df['col_name_2'])

In [ ]:
# your answer here

#### What can you say about Minute Very Active and Steps? Write a comment below

In [ ]:
# your comment here

#### We also suspect that there must be a linear relationship between the Minutes Sedentary and the Steps. Compute the correlation between these variables.

In [ ]:
# your answer here

#### Use matplotlib to visually plot Minutes Sedentary vs Steps. Based on the results of the computed correlation and the plot. What can you say about these 2 variables?

In [ ]:
# your answer here

In [ ]:
# Your comment here

#### We also suspect that there must be a linear relationship between the MinutesOfSleep and the Steps. Compute the correlation between these variables.

In [ ]:
# your answer here

#### Use matplotlib to visually plot MinutesOfSleep vs Steps. Based on the results of the computed correlation and the plot. What can you say about these 2 variables?

In [ ]:
# your answer here

#### Select a subset of your dataset with the columns below and compute the correlation matrix. Save the results in the variable `cor_fit`
column= ['Calorie burned', 'Steps','Floors','Minutes Sedentary','Minutes Very Active', 'MinutesOfSleep']

In [ ]:
# your answer here

#### Based on the result of the correlation matrix. What are the highly correlated features with the variable Steps?
*Hint: From the results above select the variable Steps and order your results in descending order (use Pandas sort_values function)*

In [ ]:
# your answer here

# Challenge 3

#### Open the `Time_Grades.csv` file and name your dataset `time_grades`

In [ ]:
# your answer here

#### Show visually the frequency distribution of the time_grades dataset.

In [ ]:
# your answer here

#### Is there a correaltion between study time and Grade? Use both Pearson and Spearman correlation and comment your results.

In [ ]:
# your answer

In [ ]:
## your answer

#### Use matplotlib to visually plot Study time vs Grade. Based on the results of the computed correlation and the plot. What can you say about these 2 variables?

In [ ]:
# your answer here

In [ ]:
#your comment here

#### Could you explain the difference between Pearson and Spearman correlation? (see References in README.md)

In [ ]:
#your comment here